# 0X Notebook-Template

# Imports

In [15]:
import sys

sys.path.append("../../")

import connection as conn

from pyspark.sql import functions as f

from etl.connectors import Hive
from etl.datamodels import HostDataClass, TableDataClass

# Settings & Utils

In [2]:
hive_host = HostDataClass(host=conn.HIVE_HOST, port=conn.HIVE_PORT)
hdfs_host = HostDataClass(host=conn.HDFS_HOST, port=conn.HDFS_PORT)

In [3]:
hive = Hive(host=hive_host, thrift_port=conn.HIVE_THRIFT_PORT)

# Hive Tests

## Hive retrieve data functions

In [4]:
tbl_employee_pay_test = TableDataClass(
    database="default",
    table_name="employee_pay_test"
)
tbl_employee_pay_test

TableDataClass(table_name='employee_pay_test', database='default', schema=None)

In [5]:
hive.get_databases()

['default', 'psa']

In [6]:
display(
    hive.get_tables(),
    hive.get_tables(database="psa")
)

['bigdata',
 'employee_pay_test',
 'firstviewonhive',
 'hiveexternaltable',
 'hiveexternaltable_parquet',
 'my_table',
 'my_table_test1113',
 'new_table',
 'new_table_2',
 'parquetfile',
 'parquetfile2']

['dbo_table', 'hiveexternaltableview', 'newtable']

In [7]:
hive.describe_table(
    table=tbl_employee_pay_test
)

           col_name data_type comment
0  transaction_date    string
1       employee_id    bigint
2         client_id    bigint
3     costcenter_id    bigint
4        paytype_id    bigint
5            amount    double

In [8]:
hive.read_table(tbl_employee_pay_test, limit=10)

,employee_pay_test.transaction_date,employee_pay_test.employee_id,employee_pay_test.client_id,employee_pay_test.costcenter_id,employee_pay_test.paytype_id,employee_pay_test.amount
0,2000-01-31,3800,50,17,1,5298.23
1,2000-01-31,3800,50,17,2,927.19
2,2000-01-31,3800,50,17,3,794.73
3,2000-01-31,3800,50,17,4,662.28
4,2000-01-31,3800,50,17,5,529.82
5,2000-01-31,3800,50,17,6,397.37
6,2000-01-31,3800,50,17,7,264.91
7,2000-01-31,3800,50,17,8,132.46
8,2000-01-31,2091,83,2,1,4795.34
9,2000-01-31,2091,83,2,2,839.18

In [9]:
hive.read_table(
    table=tbl_employee_pay_test,
    columns=["employee_id", "amount"],
    limit=15)

    employee_id   amount
0          3800  5298.23
1          3800   927.19
2          3800   794.73
3          3800   662.28
4          3800   529.82
5          3800   397.37
6          3800   264.91
7          3800   132.46
8          2091  4795.34
9          2091   839.18
10         2091   719.30
11         2091   599.42
12         2091   479.53
13         2091   359.65
14         2091   239.77

## Spark on Hive

In [10]:
spark = hive.create_spark_session()
spark

Warning: Ignoring non-Spark config property: hive.metastore.uris
Setting default log level to "WARN".
To adjust logging level use sc.setLogLevel(newLevel). For SparkR, use setLogLevel(newLevel).
23/12/22 22:29:10 WARN NativeCodeLoader: Unable to load native-hadoop library for your platform... using builtin-java classes where applicable

In [12]:
df = spark.sql(f"SELECT * FROM default.employee_pay_test")
df.show()

+----------------+-----------+---------+-------------+----------+-------+
|transaction_date|employee_id|client_id|costcenter_id|paytype_id| amount|
+----------------+-----------+---------+-------------+----------+-------+
|      2000-11-30|       7119|       83|            1|         1|5579.23|
|      2000-11-30|       7119|       83|            1|         2| 976.37|
|      2000-11-30|       7119|       83|            1|         3| 836.88|
|      2000-11-30|       7119|       83|            1|         4|  697.4|
|      2000-11-30|       7119|       83|            1|         5| 557.92|
|      2000-11-30|       7119|       83|            1|         6| 418.44|
|      2000-11-30|       7119|       83|            1|         7| 278.96|
|      2000-11-30|       7119|       83|            1|         8| 139.48|
|      2000-11-30|        612|        3|           17|         1|6263.01|
|      2000-11-30|        612|        3|           17|         2|1096.03|
|      2000-11-30|        612|        3|           17|         3| 939.45|
|      2000-11-30|        612|        3|           17|         4| 782.88|
|      2000-11-30|        612|        3|           17|         5|  626.3|
|      2000-11-30|        612|        3|           17|         6| 469.73|
|      2000-11-30|        612|        3|           17|         7| 313.15|
|      2000-11-30|        612|        3|           17|         8| 156.58|
|      2000-11-30|       4154|       92|           17|         1|5226.72|
|      2000-11-30|       4154|       92|           17|         2| 914.68|
|      2000-11-30|       4154|       92|           17|         3| 784.01|
|      2000-11-30|       4154|       92|           17|         4| 653.34|
+----------------+-----------+---------+-------------+----------+-------+
only showing top 20 rows

In [14]:
df.printSchema()

root
 |-- transaction_date: string (nullable = true)
 |-- employee_id: long (nullable = true)
 |-- client_id: long (nullable = true)
 |-- costcenter_id: long (nullable = true)
 |-- paytype_id: long (nullable = true)
 |-- amount: double (nullable = true)

In [19]:
df_agg = df.groupBy("client_id", "costcenter_id").agg(f.sum("amount").alias("total_amount"))
df_agg.show()

+---------+-------------+--------------------+
|client_id|costcenter_id|        total_amount|
+---------+-------------+--------------------+
|       92|           10|      3.5432563698E8|
|       50|            1| 3.483273433499998E8|
|       69|            2|3.3774057639000005E8|
|       50|           10|3.6544836635999995E8|
|       67|            2| 3.321358519500001E8|
|       69|           17| 3.547921280399999E8|
|       92|           17| 3.605586988500001E8|
|       63|            1|3.5656114536000025E8|
|       69|           10|3.5766427473000026E8|
|        4|           17| 3.614978070900001E8|
|       50|            2|3.6106176014999956E8|
|       27|            2|3.5264925234000015E8|
|       92|            2|3.5391423122999984E8|
|        3|           15| 3.473282307599999E8|
|       87|            1| 3.418949929499999E8|
|        4|           10| 3.398013108000001E8|
|       50|           17|      3.3833523402E8|
|       63|           17|3.3902211924000007E8|
|       27|           17|      3.5908540101E8|
|       67|            1|3.3570917918999994E8|
+---------+-------------+--------------------+
only showing top 20 rows

In [20]:
spark.stop()